{"id": "01KK6DEMWYN7YY9YHP6HVGVA9Q", "nl_query": "Is the public data portal for Hungary currently online?", "tool": "ckan_status_show", "server": "https://kozadatportal.hu/", "original_query": null}
{"id": "01KKEWSFQTAQATPC6R48P0DXCK", "nl_query": "Mi potresti trovare i dataset che riguardano il reticolo idrografico della Sicilia?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata/", "original_query": "reticolo idrografico sicilia"}
{"id": "01KJTC5X9YQRZ79JNWDWPCFNVT", "nl_query": "Quali sono tutti i dati disponibili?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": null}
{"id": "01KJQE37S0YDEGFSW4ZQ5EV4PK", "nl_query": "Can you find any datasets related to air quality in Italy?", "tool": "ckan_find_relevant_datasets", "server": "https://jikudata.org", "original_query": "air quality Italy"}
{"id": "01KJYT17SZ2MS9K56HNR89XSY1", "nl_query": "Mi puoi aiutare a trovare dati sulla popolazione straniera e gli immigrati nel quartiere Pilastro di Bologna?", "tool": "ckan_find_relevant_datasets", "server": "https://www.dati.gov.it/opendata", "original_query": "popolazione straniera immigrati Pilastro Bologna"}
{"id": "01KJYS4V3ZZCXS5KMFP4QPPGB8", "nl_query": "Quais são os datasets disponíveis sobre 'acidentes de transito' na cidade de São Paulo?", "tool": "ckan_package_search", "server": "https://dados.prefeitura.sp.gov.br", "original_query": "acidentes de transito"}
{"id": "01KKM2S9BJJAT7SMP8KXRD96K8", "nl_query": "Quali sono i dataset più rilevanti che trattano il tema del consumo di suolo?", "tool": "ckan_find_relevant_datasets", "server": "https://www.dati.gov.it/opendata", "original_query": "consumo di suolo"}
{"id": "01KJX22ME50165ZDV9M73Q48P1", "nl_query": "What datasets are available on the Europa data hub?", "tool": "ckan_package_search", "server": "https://data.europa.eu/api/hub/search", "original_query": null}
{"id": "01KKC1X92YEX970Q0V417B69WB", "nl_query": "Potresti mostrarmi i dettagli del dataset 'redditi-e-variabili-irpef-su-base-comunale-2024-a-i-2023'?", "tool": "ckan_package_show", "server": "https://www.dati.gov.it/opendata", "original_query": "redditi-e-variabili-irpef-su-base-comunale-2024-a-i-2023"}
{"id": "01KKVRZCSXJ0A6Y4KWSAS18H6Q", "nl_query": "Vorrei accedere al dataset con l'identificativo 'rilevazione-qualita-aria-2026'.", "tool": "ckan_package_show", "server": "https://www.dati.gov.it/opendata", "original_query": "rilevazione-qualita-aria-2026"}
{"id": "01KK4A2V4AV3ZP7AE578459H7Q", "nl_query": "Fammi vedere i dataset sull'inquinamento a Milano.", "tool": "ckan_find_relevant_datasets", "server": "https://dati.lombardia.it", "original_query": "inquinamento Milano"}
{"id": "01KJSS4163A2WY0TADGP3PWT2H", "nl_query": "Mi puoi mostrare i dataset sulla gestione dei rifiuti e la raccolta differenziata?", "tool": "ckan_find_relevant_datasets", "server": "https://www.dati.gov.it/opendata", "original_query": "rifiuti raccolta differenziata"}
{"id": "01KKJ4SF83DMNTBS7T30JDER2C", "nl_query": "¿Cuál es el estado actual del portal datos.gob.ar?", "tool": "ckan_status_show", "server": "https://datos.gob.ar", "original_query": null}
{"id": "01KKSTNQ81AZAQZ5P8FDY34WBV", "nl_query": "Il portale dati della Toscana è attivo e funzionante?", "tool": "ckan_status_show", "server": "https://dati.toscana.it", "original_query": null}
{"id": "01KJSS6VGZKHV571NJ66KBE92Z", "nl_query": "Mostrami i dettagli del dataset 'aria-stazioni-monitoraggio-qualita-aria-repertorio'.", "tool": "ckan_package_show", "server": "https://www.dati.gov.it/opendata", "original_query": "aria-stazioni-monitoraggio-qualita-aria-repertorio"}
{"id": "01KJWRYVP5E1FZTP9KY76XRRV7", "nl_query": "Quali dataset riguardano i rifiuti sul portale dati.gov.it?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "rifiuti"}
{"id": "01KJYBB5V23TFPQAW5PKN8YKQF", "nl_query": "Puoi elencarmi tutti i pacchetti di dati presenti sul portale dati.gov.it?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "*:*"}
{"id": "01KJWEFNJSVBJ4143FNY7Q8EGH", "nl_query": "Puoi mostrarmi i dati associati all'ID risorsa e55dccb8-7484-4d58-a97a-4ecfb66e9de0?", "tool": "ckan_datastore_search", "server": "https://data.stadt-zuerich.ch", "original_query": "e55dccb8-7484-4d58-a97a-4ecfb66e9de0"}
{"id": "01KKTT8VTWJMJFAMY1CNP8RC3Y", "nl_query": "I'm looking for data on dati.gov.it titled 'Rapporti di lavoro attivati per ripartizione geografica e genere'. Can you find it?", "tool": "ckan_package_search", "server": "https://dati.gov.it", "original_query": "title:\"Rapporti di lavoro attivati per ripartizione geografica e genere\""}
{"id": "01KJXDRYP027BTEZPQTJXM4R9C", "nl_query": "Potresti mostrarmi i dati riguardanti incidenti o sinistri stradali nella provincia di Trento?", "tool": "ckan_package_search", "server": "https://dati.trentino.it", "original_query": "text:(incidenti OR sinistri) AND text:(stradali OR strada OR traffico)"}
{"id": "01KJSJW2BYM7FQA5ND5SYKNCN5", "nl_query": "Vorrei conoscere i dettagli del dataset sugli edifici e le aree in degrado nel periodo 2014-2017.", "tool": "ckan_package_show", "server": "https://dati.comune.milano.it", "original_query": "ds503_edifici-e-aree-in-degrado-2014-2017"}
{"id": "01KK75TKATD3ZQWAXG056HKBEC", "nl_query": "Quali sono tutti i dataset presenti?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "*:*"}
{"id": "01KJSMAHCH6WSX4G5EFKC69CSX", "nl_query": "Mi puoi dare i dettagli del dataset chiamato 'rilevamento-e-misurazione-giornaliera-della-qualita-dellaria-del-comune-di-palermo-maggio-2008'?", "tool": "ckan_package_show", "server": "https://www.dati.gov.it/opendata", "original_query": "rilevamento-e-misurazione-giornaliera-della-qualita-dellaria-del-comune-di-palermo-maggio-2008"}
{"id": "01KJZYDBDNFK2BZRG81Q22Z87S", "nl_query": "Can you retrieve the data from resource ID `6099ee00-c4e6-488e-b548-cda7a9c662c9` on the Messina open data portal?", "tool": "ckan_datastore_search", "server": "https://dati.comune.messina.it", "original_query": "6099ee00-c4e6-488e-b548-cda7a9c662c9"}
{"id": "01KKK4J057FJ7D2PY23AVAA40T", "nl_query": "Are there any open data portals in Italy that contain information about Sicilia?", "tool": "ckan_find_portals", "server": "", "original_query": "country=Italy query=sicilia"}
{"id": "01KKEY2RS8ZP8PF8W651GS5DWJ", "nl_query": "Vorrei trovare dataset relativi a dipendenti, lavoro, occupazione e personale. Cosa puoi suggerirmi?", "tool": "ckan_find_relevant_datasets", "server": "https://www.dati.gov.it/opendata", "original_query": "dipendenti lavoro occupazione personale"}
{"id": "01KJWPQSV5KWCF2TNW22D56T10", "nl_query": "Cosa c'è in questo catalogo? Mostrami tutti i dati disponibili.", "tool": "ckan_package_search", "server": "https://opendata.comune.palermo.it", "original_query": "*:*"}
{"id": "01KK7X2Q02X9DWMPX7EC4G1RH3", "nl_query": "Trova dati sugli incidenti a Palermo in formato CSV.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata/", "original_query": "incidente palermo csv"}
{"id": "01KKN5N8SN0ZZXJ26CMRWBVW9R", "nl_query": "What are all the packages available?", "tool": "ckan_package_search", "server": "", "original_query": null}
{"id": "01KJWVT9F261XTJFV6M4HAXNVQ", "nl_query": "Vorrei trovare dataset sulle strutture alberghiere e sulla ricettività turistica.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "hotel OR alberghi OR \"strutture ricettive\" OR ospitalità OR ricettività"}
{"id": "01KK2PFEAVKZSQA5CEVQ2M1G51", "nl_query": "Ho bisogno di dati su alluvioni e dissesto idrogeologico per la regione Emilia-Romagna.", "tool": "ckan_find_relevant_datasets", "server": "https://dati.toscana.it/", "original_query": "alluvione dissesto idrogeologico Emilia-Romagna"}
{"id": "01KJSNTMR109ZKQC7FS8QW1CYV", "nl_query": "Mi servono informazioni generiche su edifici, fabbricati o l'uso del suolo. C'è qualcosa di disponibile?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "edifici OR fabbricati OR uso suolo"}
{"id": "01KK75S8KX5R9G5F6A3XB3ZPGZ", "nl_query": "Mostrami ogni singolo pacchetto di dati.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "*:*"}
{"id": "01KK76NCHX828D086HWZ4VCDCH", "nl_query": "Quanti dataset sono stati pubblicati da Palermo dopo il 1° gennaio 2025? Vorrei vederli raggruppati per anno e mese.", "tool": "sparql_query", "server": "", "original_query": "\nPREFIX dcat: <http://www.w3.org/ns/dcat#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n\nSELECT (YEAR(?created) AS ?anno) (MONTH(?created) AS ?mese) (COUNT(?dataset) AS ?totale)\nWHERE {\n  ?dataset a dcat:Dataset ;\n           dct:publisher ?publisher ;\n           dct:issued ?created .\n  ?publisher foaf:name ?nome .\n  FILTER(CONTAINS(LCASE(STR(?nome)), \"palermo\"))\n  FILTER(?created >= \"2025-01-01\"^^xsd:date)\n}\nGROUP BY (YEAR(?created)) (MONTH(?created))\nORDER BY ?anno ?mese\n"}
{"id": "01KJWGB3R1KSMN0NWSZJMM8ZQ0", "nl_query": "Recupera i dati dalla risorsa identificata come 'f32e7c2a-2a37-4557-9cb4-38183ddf3f0d'.", "tool": "ckan_datastore_search", "server": "https://data.stadt-zuerich.ch", "original_query": "f32e7c2a-2a37-4557-9cb4-38183ddf3f0d"}
{"id": "01KJWRR9WT4HHM74A9PE2NGFPD", "nl_query": "Vorrei trovare dataset relativi alla salute o agli ospedali in Lombardia e nelle sue province.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "(sanita OR sanità OR salute OR osped* OR asl OR \"servizi sanitari\" OR \"assistenza sanitaria\") AND (lombardia OR lombardia* OR milano OR bergamo OR brescia OR como OR cremona OR lecco OR lodi OR mantova OR monza OR brianza OR pavia OR sondrio OR varese)"}
{"id": "01KK27JCGDRWNMM3594VSD2DYJ", "nl_query": "Can you show me the 15 most recently modified datasets from the Greek government's data catalog, along with their titles?", "tool": "sparql_query", "server": "", "original_query": "\nPREFIX dcat: <http://www.w3.org/ns/dcat#>\nPREFIX dcterms: <http://purl.org/dc/terms/>\n\nSELECT ?dataset ?title ?modified\nWHERE {\n  ?dataset dcterms:title ?title ;\n           dcat:inCatalog <http://data.europa.eu/88u/catalogue/data-gov-gr> .\n  OPTIONAL { ?dataset dcterms:modified ?modified }\n  FILTER(LANG(?title) = \"en\" || LANG(?title) = \"\")\n}\nORDER BY DESC(?modified)\nLIMIT 15\n"}
{"id": "01KK4AHY0GBJZQEJXDDMECQY9H", "nl_query": "Cerca dataset sull'inquinamento a Milano su dati.gov.it.", "tool": "ckan_find_relevant_datasets", "server": "https://dati.gov.it/opendata", "original_query": "inquinamento Milano"}
{"id": "01KKCHFACD026QM6JMP7R8AR8G", "nl_query": "Vorrei vedere i dettagli del dataset con ID 725e44fe-50e4-4840-ae13-47911ca4b6be sul portale dati.toscana.it.", "tool": "ckan_package_show", "server": "https://dati.toscana.it", "original_query": "725e44fe-50e4-4840-ae13-47911ca4b6be"}
{"id": "01KKH2QMQXBNS58K83DXZPDG04", "nl_query": "Are there any open data portals in Switzerland that mention Zürich?", "tool": "ckan_find_portals", "server": "", "original_query": "country=Switzerland query=Zürich"}
{"id": "01KJREE5AYM5D1KNA9RHRZ6NA5", "nl_query": "Vorrei visualizzare tutte le risorse associate al pacchetto 'ds964-nil-vigenti-pgt-2030'.", "tool": "ckan_list_resources", "server": "https://dati.comune.milano.it", "original_query": "ds964-nil-vigenti-pgt-2030"}
{"id": "01KJZ6HS944THRM0TSERS9A0Q9", "nl_query": "Quali dati ci sono sui consumi energetici dei comuni?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "consumi energetici comuni"}
{"id": "01KJYS71F7P3YDSEQB3R2B3PR8", "nl_query": "Quero ver os detalhes do conjunto de dados sobre sinistros de trânsito. Pode me mostrar?", "tool": "ckan_package_show", "server": "https://dados.fortaleza.ce.gov.br", "original_query": "sinistros-transito"}
{"id": "01KJXDZ5X815FFXFGY0JQVADRJ", "nl_query": "Vorrei vedere le risorse del dataset 'incidenti-stradali-anno-2023'.", "tool": "ckan_list_resources", "server": "https://www.dati.gov.it/opendata", "original_query": "incidenti-stradali-anno-2023"}
{"id": "01KJZYW8MH35YWA2ZFAHEMZWG5", "nl_query": "Could you give me the titles of five datasets?", "tool": "sparql_query", "server": "", "original_query": "\nPREFIX dcat: <http://www.w3.org/ns/dcat#>\nPREFIX dct: <http://purl.org/dc/terms/>\n\nSELECT ?dataset ?title\nWHERE {\n  ?dataset a dcat:Dataset ;\n           dct:title ?title .\n}\nLIMIT 5\n"}
{"id": "01KK27JSJGZ7H50430A1VYR97H", "nl_query": "Please provide the status of the data.gov.gr portal.", "tool": "ckan_status_show", "server": "https://data.gov.gr", "original_query": null}
{"id": "01KK70MRWJT2Q35HSRZTZ7SNP5", "nl_query": "Puoi cercare dataset che parlino di acqua oppure di incidenti?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "acqua OR incidenti"}
{"id": "01KJZYD63DYDK05AMDE66V2JYS", "nl_query": "I need to access the data for resource `6099ee00-c4e6-488e-b548-cda7a9c662c9` from dati.comune.messina.it.", "tool": "ckan_datastore_search", "server": "https://dati.comune.messina.it", "original_query": "6099ee00-c4e6-488e-b548-cda7a9c662c9"}
{"id": "01KJT8S9BC1YGH9VS3R9RE7BER", "nl_query": "Cerco dataset che riguardino il catasto.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "catasto"}
{"id": "01KJW1AMEKX2S45CY5MVX34KE1", "nl_query": "Mi puoi trovare i dati sui confini territoriali, le aree statistiche o i quartieri?", "tool": "ckan_package_search", "server": "http://aperto.comune.torino.it", "original_query": "confini OR confine OR \"aree statistiche\" OR \"unità statistiche\" OR \"zone statistiche\" OR \"quartieri\""}
{"id": "01KJZYCHYNZZVYGVPZRKK3SB32", "nl_query": "Puoi controllare lo stato del portale dati del Comune di Messina?", "tool": "ckan_status_show", "server": "https://dati.comune.messina.it", "original_query": null}
{"id": "01KJTKKPZ9HWQ0HR99CV7CFV4D", "nl_query": "Find datasets related to 'Binnenwanderung Bundesländer' or 'Wanderungssaldo Bundesland'.", "tool": "ckan_package_search", "server": "https://ckan.govdata.de", "original_query": "Binnenwanderung Bundesländer OR Wanderungssaldo Bundesland"}
{"id": "01KKP82JK8J7R3PNNNWDC794KG", "nl_query": "What datasets are available related to ANNCSU on dati.gov.it?", "tool": "ckan_package_search", "server": "https://dati.gov.it", "original_query": "ANNCSU"}
{"id": "01KK1YA7FE4NDW1RV8PQCMY8TC", "nl_query": "Mi servono dataset sulla qualità dell'aria a Milano.", "tool": "ckan_find_relevant_datasets", "server": "https://www.dati.gov.it/opendata", "original_query": "qualità aria Milano"}
{"id": "01KKRRJ1Q0Q0S2S18286HFY83Z", "nl_query": "Is the server 169.254.169.254 currently online?", "tool": "ckan_status_show", "server": "http://169.254.169.254", "original_query": null}
{"id": "01KKEPYZQN7QWC3CBJ1P25NSPR", "nl_query": "Vorrei trovare dei dati sugli alberi monumentali.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "alberi monumentali"}
{"id": "01KK61KFXQ5B5Y1D5V5MDS18ZN", "nl_query": "Me gustaría encontrar información sobre accidentes, siniestros o incidentes viales en datos.gob.ar, ¿puedes ayudarme?", "tool": "ckan_package_search", "server": "https://datos.gob.ar", "original_query": "accidentes OR siniestros OR incidentes viales"}
{"id": "01KJSVKV5D6XB3R8CXCFY8G1AT", "nl_query": "Can you find relevant datasets about air quality in New York?", "tool": "ckan_find_relevant_datasets", "server": "https://dati.gov.it/opendata", "original_query": "air quality New York"}
{"id": "01KKBKZ303GB36XK3929YXF8E8", "nl_query": "Trova dataset sull'occupazione femminile, il lavoro delle donne o il gender employment.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "occupazione femminile OR lavoro donne OR gender employment"}
{"id": "01KK6DEEC91NCVSZS951AB7KQ5", "nl_query": "What is the current status of the Austrian open data catalog (data.gv.at)?", "tool": "ckan_status_show", "server": "https://www.data.gv.at/katalog/", "original_query": null}
{"id": "01KK75Q331DDAQ39K79D1FN9ZY", "nl_query": "Fammi vedere tutti i dataset presenti.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "*:*"}
{"id": "01KKQD36WRY5CJTHBEYWQX27BQ", "nl_query": "Elenca le risorse disponibili per il dataset con ID 5603d97d-cb51-4d53-90e7-bbb9f7be9ed5.", "tool": "ckan_list_resources", "server": "https://dati.gov.it/opendata", "original_query": "5603d97d-cb51-4d53-90e7-bbb9f7be9ed5"}
{"id": "01KJYT2ZY11X29HSAY6GGFV20W", "nl_query": "Mi puoi dare i dati per la risorsa con l'ID bc14d348-1d1a-4229-ae6d-7f38975c9b3a?", "tool": "ckan_datastore_search", "server": "https://www.dati.gov.it/opendata", "original_query": "bc14d348-1d1a-4229-ae6d-7f38975c9b3a"}
{"id": "01KKK9NTAR5M9SSP35DN8MSZ8J", "nl_query": "Can you provide a list of all datasets available on the Ferrara open data portal?", "tool": "ckan_package_search", "server": "https://dati.comune.fe.it/", "original_query": "*:*"}
{"id": "01KKXK8A4N3BYM6Y0KS4VP04TD", "nl_query": "Je cherche des jeux de données liés à 'adresse numéro maison housenumber'.", "tool": "ckan_find_relevant_datasets", "server": "http://data.agriculturelittorale.fr/", "original_query": "adresse numéro maison housenumber"}
{"id": "01KJT93VHP0VJFN8FWBDJBPG43", "nl_query": "Vorrei vedere i dettagli del pacchetto dati sulla disoccupazione.", "tool": "ckan_package_show", "server": "https://www.dati.gov.it/opendata", "original_query": "disoccupazione"}
{"id": "01KJZYSN0ATYQ1ER9YBZ354ZMH", "nl_query": "How many datasets in the European Union public data graph mention \"violence\" in their title?", "tool": "sparql_query", "server": "", "original_query": "\nPREFIX dcat: <http://www.w3.org/ns/dcat#>\nPREFIX dct: <http://purl.org/dc/terms/>\n\nSELECT (COUNT(DISTINCT ?dataset) AS ?count)\nWHERE {\n  GRAPH <http://data.europa.eu/88u/graph/eudp> {\n    ?dataset a dcat:Dataset ;\n             dct:title ?title .\n    FILTER(CONTAINS(LCASE(STR(?title)), \"violence\"))\n  }\n}\n"}
{"id": "01KJW1EC3XMF8TQ4W9Z5KDG3BP", "nl_query": "Mi puoi trovare dataset sugli asili nido per circoscrizione?", "tool": "ckan_package_search", "server": "http://aperto.comune.torino.it", "original_query": "nidi circoscrizione"}
{"id": "01KKEJ5JZZSF5YJRCCRSCNTZ63", "nl_query": "Could you list all available data portals specifically for Argentina?", "tool": "ckan_find_portals", "server": "", "original_query": "country=Argentina"}
{"id": "01KKTYZC23G53Z5V8DARPPX34C", "nl_query": "Cerco dataset sugli incidenti che coinvolgono velocipedi o biciclette. Cosa trovi?", "tool": "ckan_package_search", "server": "https://dati.toscana.it", "original_query": "sinistri velocipedi biciclette incidenti"}
{"id": "01KJX35GTG67AP2RJZDVSQ4C1X", "nl_query": "How many datasets are available in total?", "tool": "sparql_query", "server": "", "original_query": "SELECT (COUNT(*) AS ?total) WHERE { ?s a <http://www.w3.org/ns/dcat#Dataset> }"}
{"id": "01KKPB5RH7QQFDXGDFNKKSZ9F9", "nl_query": "Cerca per favore dataset che contengano le parole chiave 'anncsu sicilia indirizzi'.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "anncsu sicilia indirizzi"}
{"id": "01KKRRJ1VR6DZ05WPZ9DBKT1JP", "nl_query": "Can you check the status of the server at 192.168.1.1?", "tool": "ckan_status_show", "server": "http://192.168.1.1", "original_query": null}
{"id": "01KK4QM0N0YGHHWJEJ892EEZ5R", "nl_query": "Can you tell me if the opendata.dk portal is up and running?", "tool": "ckan_status_show", "server": "https://www.opendata.dk", "original_query": null}
{"id": "01KJSS3Y484P5NW9YAG30Q3TGG", "nl_query": "Cerca per me i dati sulle acque, come fiumi e laghi, e la qualità dell'acqua.", "tool": "ckan_find_relevant_datasets", "server": "https://www.dati.gov.it/opendata", "original_query": "acque fiumi laghi qualità acqua"}
{"id": "01KK6DE52QH7W654AHNVKCTG8X", "nl_query": "Where can I find other open data portals?", "tool": "ckan_find_portals", "server": "", "original_query": null}
{"id": "01KK28JMNVZKKDYSMMQM00H8KC", "nl_query": "Can you tell me if data.gov.gr is up?", "tool": "ckan_status_show", "server": "https://data.gov.gr", "original_query": null}
{"id": "01KK76Q5P324TPS15441879HJB", "nl_query": "What datasets are published on dati.gov.it?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "*:*"}
{"id": "01KK27MSW2KYVZWBZZ4SP25E7Y", "nl_query": "Could you check the status of repository.data.gov.gr for me?", "tool": "ckan_status_show", "server": "https://repository.data.gov.gr", "original_query": null}
{"id": "01KJSVM8FFX9A7K2A3WGV206QB", "nl_query": "Cerca per favore i dataset sulla qualità dell'aria.", "tool": "ckan_package_search", "server": "https://dati.gov.it/opendata", "original_query": "qualita aria"}
{"id": "01KK4Y928DJAPJ3DFK3F9GQ7JM", "nl_query": "Pode encontrar informações sobre 'violencia' nos dados abertos de Buenos Aires?", "tool": "ckan_package_search", "server": "https://data.buenosaires.gob.ar/", "original_query": "violencia"}
{"id": "01KKQD0T1VY6TGNFK835KMX92W", "nl_query": "I'm looking for datasets on dati.gov.it concerning the foreign population in Palermo's neighborhoods. Can you help?", "tool": "ckan_find_relevant_datasets", "server": "https://www.dati.gov.it/opendata", "original_query": "popolazione straniera quartieri palermo"}
{"id": "01KJSJHW48TXJK464PGXF9MZ94", "nl_query": "Vorrei trovare dataset sui confini comunali e sui limiti amministrativi. Mi aiuti?", "tool": "ckan_find_relevant_datasets", "server": "https://dati.gov.it/opendata", "original_query": "confini comunali limiti amministrativi"}
{"id": "01KJWQ573D3ZGXK61SA89TV58W", "nl_query": "Mostrami le informazioni del dataset con l'ID e55dccb8-7484-4d58-a97a-4ecfb66e9de0.", "tool": "ckan_datastore_search", "server": "https://data.stadt-zuerich.ch", "original_query": "e55dccb8-7484-4d58-a97a-4ecfb66e9de0"}
{"id": "01KKYKX0FHT3TMNHTH52D5WZQE", "nl_query": "What kind of organization is Tata Group?", "tool": "sparql_query", "server": "https://query.wikidata.org/sparql", "original_query": "\nSELECT DISTINCT ?item ?itemLabel ?typeLabel WHERE {\n  SERVICE wikibase:mwapi {\n    bd:serviceParam wikibase:api \"EntitySearch\" ;\n                    wikibase:endpoint \"www.wikidata.org\" ;\n                    mwapi:search \"Tata Group\" ;\n                    mwapi:language \"en\" .\n    ?item wikibase:apiOutputItem mwapi:item .\n  }\n  ?item wdt:P31 ?type .\n  FILTER(?type IN (wd:Q4830453, wd:Q6881511, wd:Q891723, wd:Q161726, wd:Q778575))\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} LIMIT 5\n"}
{"id": "01KK2PFR0VAYMN32RPYHQW74QG", "nl_query": "Mi puoi aiutare a trovare informazioni sull'alluvione disponibili sul portale ARPAE?", "tool": "ckan_package_search", "server": "https://dati.arpae.it/", "original_query": "alluvione"}
{"id": "01KKSPP31ZBPDM6E7964MMG5YE", "nl_query": "Cerca dati relativi alla prefettura di Palermo.", "tool": "ckan_datastore_search", "server": "https://indicepa.gov.it/ipa-dati", "original_query": "prefettura palermo"}
{"id": "01KK75Q41A1X0S8G9EVM3GPAN7", "nl_query": "Trova dataset sugli incidenti stradali a Palermo.", "tool": "ckan_find_relevant_datasets", "server": "https://dati.gov.it/opendata", "original_query": "incidenti stradali Palermo"}
{"id": "01KJT8VHACPGJ847H1FWHMMR73", "nl_query": "Elenca tutti i dataset disponibili sulla piattaforma.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": null}
{"id": "01KK10ZB2DM9FDRNHMCR8B6Q1N", "nl_query": "Are there any datasets about climate change available on the European data portal?", "tool": "ckan_package_search", "server": "https://data.europa.eu/data", "original_query": "climate change"}
{"id": "01KJW10J4VWNFZPTX0S4BHJ8NW", "nl_query": "Ci sono dati sugli asili?", "tool": "ckan_package_search", "server": "http://aperto.comune.torino.it", "original_query": "asili"}
{"id": "01KKTTA5T8BFG8HP89D6EC0NA9", "nl_query": "Can you get me the specific dataset called 'nota_trimestrale___tabella_01___rapporti_di_lavoro_attivati_per_ripartizione_geografica_e_gener' from dati.gov.it?", "tool": "ckan_package_show", "server": "https://dati.gov.it", "original_query": "nota_trimestrale___tabella_01___rapporti_di_lavoro_attivati_per_ripartizione_geografica_e_gener"}
{"id": "01KKHJ1K96AC5ASCWAVC5P2XS6", "nl_query": "I'm looking for data packages related to 'qualità aria Milano'. Can you find them on the national open data portal?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "qualità aria Milano"}
{"id": "01KKTXPBN0JFFJFZ8V3AQ6MWYY", "nl_query": "Per i dataset con gli identificativi che ti ho fornito, potresti indicarmi le date di pubblicazione e di ultima modifica?", "tool": "sparql_query", "server": "https://lod.dati.gov.it/sparql", "original_query": "PREFIX dct: <http://purl.org/dc/terms/>\n\nSELECT ?dataset ?issued ?modified WHERE {\n  VALUES ?dataset {\n    <https://dati.gov.it/catalog/dataset/0b5bd4a0-fb9c-4aec-8045-448cc612ac94>\n    <https://dati.gov.it/catalog/dataset/e0455e57-7553-4ce9-8e3c-ba37ffce4a58>\n    <https://dati.gov.it/catalog/dataset/db65b4e3-1050-4e78-8403-9d88baf6eea0>\n    <https://dati.gov.it/catalog/dataset/57ca34da-425a-4607-93af-55ba9e188eff>\n    <https://dati.gov.it/catalog/dataset/5b185e40-badd-4c55-b217-d48f990b197a>\n    <https://dati.gov.it/catalog/dataset/a609423a-4836-474e-8fb6-e9c83de5ba82>\n    <https://dati.gov.it/catalog/dataset/b6e909a0-53cd-417d-a37f-04c11fed8939>\n    <https://dati.gov.it/catalog/dataset/e5a35ac2-609e-4b5f-b7c9-d23bb3d53d13>\n    <https://dati.gov.it/catalog/dataset/451b41b8-34e2-441d-965a-2efda6072b10>\n    <https://dati.gov.it/catalog/dataset/0bf1ffc0-a33d-4b5d-a6a5-486e55c7d1f7>\n  }\n  OPTIONAL { ?dataset dct:issued ?issued }\n  OPTIONAL { ?dataset dct:modified ?modified }\n}"}
{"id": "01KJQVY3PQB0TBFAJ8WSPKXSKN", "nl_query": "Cerco dataset sugli appalti per l'edilizia in Emilia Romagna. Puoi aiutarmi?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "appalti edilizia Emilia Romagna"}
{"id": "01KKPYEQ0JVMTXW5YDTY64GKT8", "nl_query": "Vorrei visualizzare le medie delle concentrazioni annuali del benzene (C6H6) come inquinante atmosferico in Veneto dal 2002 al 2024.", "tool": "ckan_list_resources", "server": "https://www.dati.gov.it/opendata", "original_query": "medie-delle-concentrazioni-annuali-dellinquinante-atmosferico-benzene-c6h6-in-veneto-2002-2024"}
{"id": "01KK75PSBPB9A09NVE9GAC9YPC", "nl_query": "Vorrei esplorare tutti i contenuti del portale, puoi elencarli?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "*:*"}
{"id": "01KKPYEQ7BPZ42QRKB0AM50MZF", "nl_query": "Mi interessano le medie annuali delle concentrazioni di benzoapirene (IPA) in Veneto tra il 2002 e il 2024.", "tool": "ckan_list_resources", "server": "https://www.dati.gov.it/opendata", "original_query": "medie-delle-concentrazioni-annuali-dellinquinante-atmosferico-benzoapirene-ipa-in-ven-2002-2024"}
{"id": "01KK1XD6QXFMTPBR7ZYSSPHGMR", "nl_query": "List all the available open data portals.", "tool": "ckan_find_portals", "server": "", "original_query": null}
{"id": "01KK2685EERVA9MPG1V08XXDTF", "nl_query": "Can you provide an update on the status of ckan.opendata.gr?", "tool": "ckan_status_show", "server": "https://ckan.opendata.gr", "original_query": null}
{"id": "01KJSYD91G3VMKCM59ACJSKMSH", "nl_query": "Cerca pacchetti di dati relativi alla qualità dell'aria a Milano.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "Milano qualita aria"}
{"id": "01KKGJ959TSFW1PXPWND0S3DVJ", "nl_query": "What packages can I find on the dati.gov.it open data portal?", "tool": "ckan_package_search", "server": "https://dati.gov.it/opendata", "original_query": null}
{"id": "01KKKPNS2NGYJN1TEWZJ4QFB1Z", "nl_query": "Cerca tutti i dataset che riguardano il catasto, i dati catastali, le particelle o i fabbricati.", "tool": "ckan_package_search", "server": "https://dati.gov.it/opendata", "original_query": "catasto OR catastale OR catastali OR particelle OR fabbricati catastali"}
{"id": "01KJW1D8FYGTXR0QBY2SKCCYAJ", "nl_query": "Cerca dataset che collegano gli asili nido alle circoscrizioni.", "tool": "ckan_package_search", "server": "http://aperto.comune.torino.it", "original_query": "nidi AND circoscrizione"}
{"id": "01KJQHQZVABMW8GHG73RRJK5YN", "nl_query": "Potresti mostrarmi il dataset 'report-qualita-aria-2024'?", "tool": "ckan_package_show", "server": "https://www.dati.gov.it/opendata", "original_query": "report-qualita-aria-2024"}
{"id": "01KJZYWWW37NJFFJJR5Z5ZMVSJ", "nl_query": "What are some SKOS concepts with English labels that contain the word 'violence'? Provide up to 20 results.", "tool": "sparql_query", "server": "", "original_query": "\nPREFIX dcat: <http://www.w3.org/ns/dcat#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n\nSELECT DISTINCT ?concept ?label\nWHERE {\n  ?concept a skos:Concept ;\n           skos:prefLabel ?label .\n  FILTER(LANG(?label) = \"en\")\n  FILTER(CONTAINS(LCASE(STR(?label)), \"violence\"))\n}\nLIMIT 20\n"}
{"id": "01KK263GEM8XH6K27WZSP4TK55", "nl_query": "Check the status of the opendata.imet.gr portal for me.", "tool": "ckan_status_show", "server": "https://opendata.imet.gr", "original_query": null}
{"id": "01KKEY6YYB4SJHCKGV6SYXMWT4", "nl_query": "Is the bdap-opendata.rgs.mef.gov.it portal online?", "tool": "ckan_status_show", "server": "https://bdap-opendata.rgs.mef.gov.it", "original_query": null}
{"id": "01KJZB1X2HEYQGN2YK11HGKFKV", "nl_query": "Fammi vedere la superficie e il territorio dei comuni di Lecco.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "comuni superficie territorio Lecco"}
{"id": "01KKK9PMP642P87MKH0J6J33TW", "nl_query": "Show me all available datasets from dati.gov.it.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "*:*"}
{"id": "01KJWTR9A1SYNH9VHGWTN795CX", "nl_query": "Quali sono i dataset disponibili sulla raccolta differenziata?", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "raccolta differenziata"}
{"id": "01KJZ07VZRREQP2ZSCFT9CJG1P", "nl_query": "How many datasets are there in total?", "tool": "sparql_query", "server": "", "original_query": "SELECT (COUNT(?s) AS ?datasetCount) WHERE {?s a dcat:Dataset .}"}
{"id": "01KK4AASVPPNG0PFC167Y3NG0W", "nl_query": "Trova i dataset del Comune di Milano che trattano la qualità dell'aria, disponibili su dati.gov.it.", "tool": "ckan_package_search", "server": "https://www.dati.gov.it/opendata", "original_query": "organization:comune-di-milano AND (title:\"qualità aria\" OR title:\"qualita aria\" OR tags:qualita-aria OR notes:\"qualità dell'aria\")"}
{"id": "01KK2PNXGWKADXVPNW8ECDZ3Z9", "nl_query": "Potresti elencarmi i dataset che riguardano idrografia, reticolo e fiumi?", "tool": "ckan_package_search", "server": "https://dati.arpae.it/", "original_query": "idrografia reticolo fiumi"}
{"id": "01KKGNSS8VG15FPEZX7KNRNG49", "nl_query": "Puoi fornirmi le informazioni complete per il dataset '99b17a43-773c-4b98-93fe-b97d1cb47d12'?", "tool": "ckan_package_show", "server": "https://www.dati.gov.it/opendata", "original_query": "99b17a43-773c-4b98-93fe-b97d1cb47d12"}
